{
    "doa" : [
              {
                "id": 1,
                "judul" :"Do'a Bangun Tidur",
                "arab": "الْحَمْدُ لِلّٰهِ الّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
                "latin":"Alhamdulillahilladzi ahyaana ba'da maa amaatanaa wa ilaihinnusyuur",
                "arti":"Segala puji bagi Allah Yang membangunkan kami setelah ditidurkan-Nya dan kepada-Nya kami dibangkitkan",
                "footnote" :"HR. Bukhari dalam Fathul Bari: 11/113 dan Muslim: 4/2083"
              },
              {
                "id": 2,
                "judul":"Do'a Mengenakan Pakaian",
                "arab":"اَلْحَمْدُ لِلّٰهِ الَّذِي كَسَانِيْ هَذَا (الثَّوْبَ) وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِنِّيْ وَلَا قُوَّةٍ",
                "latin":"Alhamdulillahilladzi kasaanii hadzaatssauba warozaqoniihi min ghairi khaulin minnii walaa quwwatin",
                "arti":"Segala puji bagi Allah Yang telah memberikan pakaian ini kepadaku sebagai rezeki dari-pada-Nya tanpa daya dan kekuatan dari-ku",
                "footnote":"Hadits diriwayatkan oleh semua penyusun kitab sunan, kecuali Nasa'i, lihat: Irwa'ul ghalil"
              },
              {
                "id": 3,
                "judul":"Do'a Mengenakan Pakaian Baru",
                "arab":"اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنعَ لَهُ",
                "latin":"Allohumma lakalhamdu anta kasautaniihi, as'aluka min khoirihi wa khoiri maa shun'a lahu, wa a'uudzubika min syarrihi wasyarrima shun'a lahu",
                "arti":"Ya Allah hanya miliki-Mu segala puji, Engkaulah yang memberi pakaian ini kepadaku. Aku mohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang ia diciptakan karenanya",
                "footnote":"HT. Abu Dawud, At-Tirmidzi, Al-Baghawi dan lihat Mukhtashar Syamaailit Tirmidzi, oleh Al-Albani, hal: 47"
              },
              {
                "id": 4,
                "judul":"Doa Meletakkan Pakaian",
                "arab":"بِسْمِ اللّٰهِ",
                "latin":"Bismillah",
                "arti":"Dengan nama Allah (aku meletakkan baju)",
                "footnote":"HR. At-Tirmidzi: 2/505 dan Imam yang lain. Lihat Irwa'ul Ghalil, 49 dan Shahihul Jami': 3/230"
              },
              {
                "id": 5,
                "judul":"Doa Masuk Toilet",
                "arab":"(بِسْمِ اللّٰهِ) اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبائِثْ",
                "latin":"(Bismillahi) Allohumma inni a'udzubika minal khubutsi wal khobaits",
                "arti":"Dengan nama Allah. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan",
                "footnote":"Hr. Al-Bukhari: 1/45 dan Muslim: 1/283. Sedang tambahan 'bismillah' pada permulaan hadits, menurut riwayat Said bin Manshur. Lihat Fathul Baari: 1/244"
              },
              {
                "id": 6,
                "judul":"Doa Keluar dari Toilet",
                "arab":"غُفْرَانَكَ",
                "latin":"Ghufronaka",
                "arti":"Aku minta ampun kepada-Mu",
                "footnote":"Hadist diriwayatkan oleh para penulis kutubus sunan kecuali Imam Nasa'i, beliau meriwayatkan di kitab amalul yaumi wa lailah, lihat juga takhrij zadil maad 2/122"
              },
              {
                "id": 7,
                "judul":"Bacaan Setelah Wudhu",
                "arab":"سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
                "latin":"Subhanakallohumma wabihamdika asyhadu anlaailaha illa anta astaghfiruka wa'atubu ilaik",
                "arti":"Maha Suci Engkau, ya Allah, aku memuji kepada-Mu. Aku bersaksi, bahwa tiada Tuhan yang haq disembah selain Engkau, aku minta ampun dan bertaubat kepada-Mu",
                "footnote":"HR. An-Nasa'i dalam 'Amalul Yaumi wal Lailah,  halaman: 173 dan lihat Irwa'ul Ghalil: 1/135 dan 2/94"
              },
              {
                "id": 8,
                "judul":"Do'a Keluar Rumah",
                "arab":"بِسْمِ اللَّهِ، تَوَكَّلتُ عَلَى اللّٰهِ،  وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ",
                "latin":"Bismillahi tawakkaltu 'alalloh, wala haula wala quwata illa billah",
                "arti":"Dengan nama Allah (aku keluar). Aku bertawakkal kepada-Nya, dan tiada daya dan kekuatan kecuali karena pertolongan Allah",
                "footnote":"HR. Abu Dawud: 4/325. At-Tirmidzi: 5/490, dan lihat Shahih At-Tirmidzi: 3/151"
              },
              {
                "id": 9,
                "judul":"Do'a Masuk Rumah",
                "arab":"بِسْمِ اللّٰهِ وَلَجْنَا، وَبِسْمِ اللّٰهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
                "latin":"Bismillahi walaj'na wabismillahi khoroj'na wa'ala robbina yatawakkaluna",
                "arti":"'Dengan nama Allah, kami masuk (ke rumah), dengan nama Allah, kami keluar (darinya) dan kepada Tuhan kami, kami bertawakkal'. Kemudian mengucapkan salam kepada keluarganya",
                "footnote":"HR. Abu Dawud: 4/325, dan Al-'Allamah Ibnu Baaz berpendapat, isnad hadits tersebut hasan dalam Tuhfatul Akhyar, no. 28. Dalam Kitab Shahih: 'Apabila seseorang masuk rumahnya lalu berdzikir kepada Allah ketika masuk rumah dan makan, syaitan berkata (kepada teman-temannya), \"Tiada tempat tinggal dan makanan bagi kalian (malam ini)\"'. Muslim, no. 2018"
              }
      ]
}